Repository: mervcelik/Ledger
Catalog: src/LedgerProject/Infrastructure/Localization/Resources/Messages.*.resx
Languages: tr

# AP.CompanyIdGreaterThanZero
source: Select a Company!
tr: Şirket Seçiniz!

# AP.EndDateLessThanStartDate
source: The end date cannot be earlier than the start date.
tr: Bitiş Tarihi başlangıç tarihinden küçük olamaz.

# AP.StartDateGraterThanEndDate
source: The start date cannot be greater than the end date.
tr: Başlangıç ​​tarihi bitiş tarihinden büyük olamaz.

# AP.NameNotNull
source: Accounting period Name can not be empty
tr: Dönem adı alanı boş bırakılamaz.

# Company.NameLenght
source: The company name must be more than 3 characters long.
tr: Şirket ismi 3 karakterden fazla olmalıdır

# Company.NameNotEmpty
source: Company name can not be empty
tr: Şirket adı boş olamaz.

# Company.NotUnique
source: Company name must be unique.
tr: Aynı isimde birden fazla şirket eklenemez.

# AP.DateRangeMustNotOverlap
source: The accounting period date range overlaps with an existing period.
tr: Muhasebe dönemi tarih aralığı mevcut bir dönemle örtüşüyor.

# AP.NameNotUniqie
source: The accounting period Name must be unique.
tr: Muhasebe dönemi adı benzersiz olmalıdır.

# CA.NameCanNotBeDuplicated
source: A current registration with the same name already exists.
tr: Aynı isimde bir cari kaydı mevcut

# CA.NameNotNull
source: The current name can not be empty
tr: Cari İsmi boş olmamalıdır.

# CA.TaxNumberNotNull
source: The Current Tax Number Can not be empty
tr: Cari vergi numarası boş olmamalıdır.

# CA.CompanyIdNotNull
source: Company must be select
tr: Şirket seçiniz

# CA.CompanyMustExist
source: The selected company was not found.
tr: Seçilen şirket bulunamadı.

# CA.TaxNumberMustBeUnique
source: A current registration with this tax number already exists.
tr: Bu vergi numarasında zaten bir cari kayıt mevcut.

# CompanyUser.NotUnique
source: This user is already assigned to this company.
tr: Bu kullanıcı zaten bu şirkete atanmış.

# CompanyUser.IdGreaterThanZero
source: Please select a valid company user.
tr: Geçerli bir şirket kullanıcısı seçiniz.

# CompanyUser.UserIdNotEmpty
source: Please select a user.
tr: Kullanıcı seçiniz.

# CompanyUser.CompanyIdNotEmpty
source: Please select a company.
tr: Şirket seçiniz.

# CompanyUser.CompanyMustExist
source: The selected company was not found.
tr: Seçilen şirket bulunamadı.

# CompanyUser.UserMustExist
source: The selected user was not found.
tr: Seçilen kullanıcı bulunamadı.

# CurrentMovement.CurrentAccountMustExist
source: The selected current account was not found.
tr: Seçilen cari hesap bulunamadı.

# CurrentMovement.AccountingPeriodMustExist
source: The selected accounting period was not found.
tr: Seçilen muhasebe dönemi bulunamadı.

# CurrentMovement.AccountingPeriodMustNotBeClosed
source: The accounting period is closed, no movement can be added.
tr: Muhasebe dönemi kapatılmış, hareket eklenemez.

# CurrentMovement.MovementTypeMustExist
source: The selected movement type was not found.
tr: Seçilen hareket türü bulunamadı.

# CurrentMovement.CompanyMustExist
source: The selected company was not found.
tr: Seçilen şirket bulunamadı.

# CurrentMovement.DateMustBeWithinAccountingPeriod
source: The movement date must be within the accounting period date range.
tr: Hareket tarihi muhasebe döneminin tarih aralığında olmalıdır.

# CurrentMovementDetail.CurrentMovementMustExist
source: The selected movement was not found.
tr: Seçilen hareket bulunamadı.

# CurrentMovementDetail.QuantityMustBeGreaterThanZero
source: Quantity must be greater than zero.
tr: Miktar sıfırdan büyük olmalıdır.

# CurrentMovementDetail.AmountMustBeGreaterThanZero
source: Amount must be greater than zero.
tr: Tutar sıfırdan büyük olmalıdır.

# CurrentMovementDetail.TaxPercentMustBeValid
source: Tax rate must be between 0 and 100.
tr: Vergi oranı 0 ile 100 arasında olmalıdır.

# CurrentMovementDetail.TotalAmountMustBeGreaterThanZero
source: Total amount must be greater than zero.
tr: Toplam tutar sıfırdan büyük olmalıdır.

# MovementType.NameCanNotBeDuplicated
source: A movement type with this name already exists.
tr: Aynı isimde bir hareket türü zaten mevcut.

source: Movement type name cannot be empty.
tr: Hareket türü adı boş olamaz.

# MovementType.CompanyMustExist
source: The selected company was not found.
tr: Seçilen şirket bulunamadı.

# MovementType.IdGreaterThanZero
source: Please select a valid movement type.
tr: Geçerli bir hareket türü seçiniz.

# User.IdGreaterThanZero
source: Please select a valid user.
tr: Geçerli bir kullanıcı seçiniz.

# User.FirstNameNotEmpty
source: User first name cannot be empty.
tr: Kullanıcı adı boş olamaz.

# User.FirstNameMinLength
source: User first name must be at least 2 characters.
tr: Kullanıcı adı en az 2 karakter olmalıdır.

# User.LastNameNotEmpty
source: User last name cannot be empty.
tr: Kullanıcı soyadı boş olamaz.

# User.LastNameMinLength
source: User last name must be at least 2 characters.
tr: Kullanıcı soyadı en az 2 karakter olmalıdır.

# User.UserNameNotEmpty
source: User name cannot be empty.
tr: Kullanıcı adı boş olamaz.

# User.UserNameMinLength
source: User name must be at least 3 characters.
tr: Kullanıcı adı en az 3 karakter olmalıdır.

# User.PasswordNotEmpty
source: Password cannot be empty.
tr: Şifre boş olamaz.

# User.PasswordMinLength
source: Password must be at least 8 characters.
tr: Şifre en az 8 karakter olmalıdır.

source: Session Not Found
tr: Oturum bulunamadı.

source: Invalid User Name
tr: Kullanıcı bulunamadı
